Autodesk.Revit.DB.LinearDimension.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Creates a new instance of an Linear Dimension element within the project.
document:
The document where new Linear Dimension is created.
dbView:
The view in which the Linear Dimension will appear.
line:
The line of the annotation
references:
references that the Linear Dimension will witness.
Returns:
The newly created Linear Dimension instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.LinearDimension
LinearDimString
Since:
2025